# Question 5

In [1]:
import pandas as pd
import numpy as np

In [4]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv'
chipotle = pd.read_csv(url, sep = '\t')
chipotle.head(10)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25

In [5]:
# number of observations in the dataset
chipotle.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [38]:
# number of observations in the dataset
print("Total # of observation in dataset : {}".format(chipotle.shape[0]))

Total # of observation in dataset : 4622

In [39]:
# number of columns in the dataset
print("Total columns in dataset : {}".format(chipotle.shape[1]))

Total columns in dataset : 6

In [40]:
# name of all the columns
chipotle.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description', 'item_price',
       'revenue'],
      dtype='object')

In [41]:
# dataset indexed
chipotle.index

RangeIndex(start=0, stop=4622, step=1)

In [42]:
# the most-ordered item
chipotle.groupby(by="item_name").sum().sort_values('quantity',ascending=False).head(10)

                              order_id  quantity  item_price  revenue
item_name
Chicken Bowl                    713926       761     7342.73  8044.63
Chicken Burrito                 497303       591     5575.82  6387.06
Chips and Guacamole             449959       506     2201.04  2475.62
Steak Burrito                   328437       386     3851.43  4236.13
Canned Soft Drink               304753       351      438.75   603.75
Chips                           208004       230      494.34   580.34
Steak Bowl                      193752       221     2260.19  2479.81
Bottled Water                   175944       211      302.56   649.18
Chips and Fresh Tomato Salsa    100419       130      361.36  1033.96
Canned Soda                      76396       126      137.34   191.84

In [43]:
# most-ordered item, how many items were ordered
item_quants = chipotle.groupby(['item_name']).agg({'quantity':'sum'})
item_quants.sort_values(by='quantity', ascending=False)[:1]

              quantity
item_name
Chicken Bowl       761

In [44]:
# most ordered item in the choice_description column
item_quants = chipotle.groupby(['choice_description']).agg({'quantity':'sum'})
item_quants.sort_values(by='quantity', ascending=False)[:1]

                    quantity
choice_description
[Diet Coke]              159

In [45]:
# Items were orderd in total
chipotle.quantity.sum()

4972

In [46]:
chipotle.item_price.dtypes

dtype('float64')

In [47]:
# Create a lambda function and change the type of item price
try:
    Item_Price = lambda x: float(x[1:-1])
    chipotle.item_price=chipotle.item_price.apply(Item_Price)
except:TypeError

In [48]:
# Item price type
chipotle.item_price.dtypes

dtype('float64')

In [49]:
# Revenue for the period in the dataset
rev = (chipotle.item_price * chipotle.quantity).sum()
print('Revenue is : $ '+str(rev))

Revenue is : $ 39237.02

In [50]:
# orders were made in the period
chipotle.order_id.value_counts().count()

1834

In [51]:
# average revenue amount per order
chipotle['revenue'] = chipotle['quantity'] * chipotle['item_price']
order_grouped = chipotle.groupby(by=['order_id']).sum()
order_grouped.mean()['revenue']

21.394231188658654

In [52]:
# different items are sold
chipotle['item_name'].nunique()

50